cases/artigo_mestrado/old/on-fsi-2/fluid/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5760
(
0.0012509814
0.0013662996
0.0014816294
0.0014272341
0.0015587997
0.0016903786
0.0015486391
0.0016913961
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
0.0012509814
0.0014272341
0.0015486391
0.0016105308
0.0016105308
0.0015486391
0.0014272341
0.0012509814
...
)
;
    }
    fsi_pia
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
0.0011923971
0.0013603958
0.0014761153
0.0015351086
0.0015351086
0.0014761153
0.0013603958
0.0011923971
...
)
;
    }
    fsi_dura
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
0.0018078273
0.0020625353
0.0022379812
0.0023274227
0.0023274227
0.0022379812
0.0020625353
0.0018078273
...
)
;
    }
    fsi_sclera_peri
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
0.0012509814
0.0014272341
0.0015486391
0.0016105308
0.0016105308
0.0015486391
0.0014272341
0.0012509814
...
)
;
    }
    fsi_sclera_ring
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
0.0015838758
0.0018070307
0.0019607424
0.002039104
0.002039104
0.0019607424
0.0018070307
0.0015838758
...
)
;
    }
}


// ************************************************************************* //
